# данный image мы базиурем на основе ноды. Если нет локально то скачает самостоятельно
FROM node   

# раб. дериктория где находится наш проект, если мы уже указал воркдир то можно прописать в COPY . .  , последнюю точку (в корень то есть в /app)
WORKDIR /app

COPY package.json .

#установка зависимостей, RUN запускается когда мы строим непосредственно образ, а CMD когда запускаем 
RUN npm install

COPY . .

RUN npm run build

ENV PORT 5000
#установка порта
EXPOSE $PORT



#запуск приложения
CMD ["npm", "run", "start"]